/*
 На планете Торус 6x4 живут торусианцы трёх цветов (красные, зелёные и синие).
Первые 24 квадрата таблицы utQ, отсортированные по Q_ID - страны планеты:
Т00 - первый квадрат
Т03 - четвёртый квадрат
Т10 - пятый квадрат
T53 - двадцать четвертый квадрат
Количество краски на квадрате - численность торусианцев соответствующего цвета в стране (R, G, B).
В день рождения Меркадота все торусианцы в каждой стране разбиваются на группы - 8 групп каждого цвета; численность каждой группы определяется как R/8, G/8, B/8 - и направляются в 8 соседних стран (по одной группе каждого цвета на страну).
Не попавшие в группы торусианцы в количестве R%8, G%8, B%8 остаются дома.
Найти количество торусианцев каждого цвета в каждой стране в этот знаменательный день.
Вывести на карте Меркадота для страны "Т00" количество торусианцев каждого цвета в странах Txy (x - номер строки, y - номер столбца) в формате "Txy - cccR cccG cccB", где Txy - название страны, ccc - количество с ведущими нулями.
 */

 
